# | Copyright (C) 2023-2024 John Ciolfi
# |
# | This program is free software: you can redistribute it and/or modify
# | it under the terms of the GNU General Public License as published by
# | the Free Software Foundation, either version 3 of the License, or
# | (at your option) any later version.
# |
# | This program is distributed in the hope that it will be useful,
# | but WITHOUT ANY WARRANTY; without even the implied warranty of
# | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# | GNU General Public License for more details.
# |
# | You should have received a copy of the GNU General Public License
# | along with this program.  If not, see <http://www.gnu.org/licenses/>.
# |
# | Commentary:
# |
# | Use this as a template for creating org-files with MATLAB and other language code blocks.
# | The '#+COMMENT' lines configure org-mode.

#+startup: showall
#+startup: inlineimages       //  C-c C-x C-v to toggle, C-c C-x C-M-v to redisplay
#+startup: latexpreview       //  C-c C-x C-l to toggle

#+html_head_extra: <link rel="stylesheet" type="text/css" href="css/styles-from-org.css"/>
#+html_head_extra: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+options: ^:{}
#+options: toc:nil
#+latex_header: \usepackage[margin=0.5in]{geometry}
#+latex_header: \usepackage{parskip}
#+latex_header: \usepackage{tocloft}
#+latex_header: \advance\cftsecnumwidth 0.5em\relax
#+latex_header: \advance\cftsubsecindent 0.5em\relax
#+latex_header: \advance\cftsubsecnumwidth 0.5em\relax

# | Specifying "#+property: header-args+ :eval no-export" disables code block evaluation
# | prompting during export to HTML, PDF, etc.
#+property: header-args+ :eval no-export

** matlab code block evaluation with ~output~ results

The ":results output" matlab code block header option instructs org to insert the MATLAB command
window output. The ":exports both" header option says, keep the MATLAB code and also the results
when exporting.  If you want to see only the results, leave off the ":exports both" option.

#+begin_src matlab :exports both :results output
  disp('The results are:')
  a = [1, 2; 3, 4]
  b = a * 2
#+end_src

#+RESULTS:
#+begin_example
The results are:

a =

     1     2
     3     4

b =

     2     4
     6     8
#+end_example

** org matlab code block evaluation reuses the ~*MATLAB*~ shell buffer

MATLAB code block evaluation reuses the ~*MATLAB*~ buffer created by ~M-x matlab-shell~.  The
MATLAB workspace state is maintained between evaluations.  To avoid reuse of state, you can
clear the MATLAB workspace.  You can see the history of the evaluations in the ~*MATLAB*~ buffer.
For example, evaluation of the following in order illustrates how state is maintained between
the code blocks.

1. First code block

   #+begin_src matlab :exports both :results output
     a = 123
   #+end_src

   #+RESULTS:
   : a =
   : 
   :    123

2. Second code block uses the variable ~a~ created by the first code block.

   #+begin_src matlab :exports both :results output
     b = a + 1000
   #+end_src

   #+RESULTS:
   : b =
   : 
   :         1123

3. Third code block clears the workspace and references 'b' which is known:

   #+begin_src matlab :exports both :results output
     clear
     c = b * 2
   #+end_src

   #+RESULTS:
   : Unrecognized function or variable 'b'.

** matlab code block evaluation with ~verbatim~ results

When the matlab code block header contains ":results verbatim", the value of the MATLAB ~ans~
variable is saved using ~writematrix(ans, orgTmpFile, 'Delimiter', 'tab')~ and then the contents of
the /orgTmpFile/ is inserted under the "#+RESULTS:".

#+begin_src matlab :exports both :results verbatim
  a = 2 + 3;
  ans = magic(a);
#+end_src

#+RESULTS:
| 17 | 24 |  1 |  8 | 15 |
| 23 |  5 |  7 | 14 | 16 |
|  4 |  6 | 13 | 20 | 22 |
| 10 | 12 | 19 | 21 |  3 |
| 11 | 18 | 25 |  2 |  9 |

** matlab code block evaluation with ~latex~ results

With the [[https://www.mathworks.com/help/symbolic/][Symbolic Math Toolbox]], you can produce LaTeX using the header option ":results output latex":

#+begin_src matlab :exports both :results output latex
  m = [4*pi, 3*pi; 2*pi, pi];
  result = latex(sym(m));
  disp(result)
#+end_src

#+RESULTS:
#+begin_export latex
\left(\begin{array}{cc} 4\,\pi  & 3\,\pi \\ 2\,\pi  & \pi  \end{array}\right)
#+end_export

You can use LaTeX directly, for example:

#+begin_export latex
\begin{align}
y(t)       = & f_o(t,x_c,x_d,u,P) && - \text{ outputs } \\
\dot{x}_c(t) = & f_d(t,x_c,x_d,u,P) && - \text{ derivatives } \\
x_d(t+h)   = & f_u(t,x_c,x_d,u,P) && - \text{ update }
\end{align}
#+end_export

